In [1]:
import numpy as np

In [2]:
import pandas as pd

In [7]:
A = [1,2,3,4]
B = [5,6,6,7]
C = [9,9,9,9]
D = [10,11,12,13]

In [8]:
df = pd.DataFrame([A,B,C,D],['a','b','c','d'],['X','Y','Z','W'])

In [9]:
df

    X   Y   Z   W
a   1   2   3   4
b   5   6   6   7
c   9   9   9   9
d  10  11  12  13

In [12]:
df['P'] = df['Y']+df['X']   #adding a new column

In [13]:
df

    X   Y   Z   W   P
a   1   2   3   4   3
b   5   6   6   7  11
c   9   9   9   9  18
d  10  11  12  13  21

In [15]:
df.drop('a')   #temporary deletion of a row

    X   Y   Z   W   P
b   5   6   6   7  11
c   9   9   9   9  18
d  10  11  12  13  21

In [16]:
df

    X   Y   Z   W   P
a   1   2   3   4   3
b   5   6   6   7  11
c   9   9   9   9  18
d  10  11  12  13  21

In [22]:
df.drop('d', inplace=False)  #permanent deletion of a row

   X  Y  Z  W   P
a  1  2  3  4   3
b  5  6  6  7  11
c  9  9  9  9  18

In [23]:
df.drop('X' ,axis=1 )   #temporary deletion of a column

    Y   Z   W   P
a   2   3   4   3
b   6   6   7  11
c   9   9   9  18
d  11  12  13  21

In [30]:
df

    Y   Z   W   P
a   2   3   4   3
b   6   6   7  11
c   9   9   9  18
d  11  12  13  21

In [35]:
df.drop('Z' ,axis=1,inplace=True)     #permanent deletion of a row

In [36]:
df

    W   P
a   4   3
b   7  11
c   9  18
d  13  21

In [37]:
A = [1,2,3,4]
B = [5,6,6,7]
C = [9,9,9,9]
D = [10,11,12,13]

In [38]:
df1 = pd.DataFrame([A,B,C,D],['a','b','c','d'],['X','Y','Z','W'])

In [39]:
df1

    X   Y   Z   W
a   1   2   3   4
b   5   6   6   7
c   9   9   9   9
d  10  11  12  13

In [42]:
df1['X']     ## acessing a column

a     1
b     5
c     9
d    10
Name: X, dtype: int64

In [43]:
df1.loc['a']   ##acessing a row

X    1
Y    2
Z    3
W    4
Name: a, dtype: int64

In [44]:
## conditional acess of element from DataFrame

In [46]:
df1>2

       X      Y     Z     W
a  False  False  True  True
b   True   True  True  True
c   True   True  True  True
d   True   True  True  True

In [47]:
df1[df1>2]

      X     Y   Z   W
a   NaN   NaN   3   4
b   5.0   6.0   6   7
c   9.0   9.0   9   9
d  10.0  11.0  12  13

In [53]:
df1[df1>1][['X','W']]

      X   W
a   NaN   4
b   5.0   7
c   9.0   9
d  10.0  13

In [58]:
df1[df1['W']>3]&df1[df1['W']>3]

    X   Y   Z   W
a   1   2   3   4
b   5   6   6   7
c   9   9   9   9
d  10  11  12  13

In [59]:
## missing values

In [63]:
t = {'a': [1,2,3,4,np.nan] ,'b': [3,4,5,np.nan,np.nan] ,'c': [9,7,np.nan,np.nan,np.nan],'d': [9,np.nan,np.nan,np.nan,np.nan],'e': [np.nan,np.nan,np.nan,np.nan,np.nan] }

In [67]:
tf = pd.DataFrame(t)

In [65]:
tf

     a    b    c    d   e
0  1.0  3.0  9.0  9.0 NaN
1  2.0  4.0  7.0  NaN NaN
2  3.0  5.0  NaN  NaN NaN
3  4.0  NaN  NaN  NaN NaN
4  NaN  NaN  NaN  NaN NaN

In [77]:
tf['e'].fillna(value = tf['e'].mean())

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: e, dtype: float64